app/Models/ClientModel.php

SELECT *
FROM `clients`
---
    public function getClients()
    {
        return $this->findAll();