app/Models/CommandeModel.php

    public function getCommande()
    {
        return $this->findAll();
---
SELECT *
FROM `commandes`