app/Models/ProduitModel.php

SELECT *
FROM `produits`
---
    public function getProduits()
    {
        return $this->findAll();